Revit 2024 API
Outline Methods
The Outline type exposes the following members.
Methods
Name | Description
AddPoint
 Adds a point to the bounding box, expanding it if the point is outside the existing boundary.
Contains
 Determine if this Outline contains the specified point to within a tolerance.
ContainsOtherOutline
 Determine if this Outline contains another Outline to within tolerance.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetDiagonalLength
 Get the length of outline's diagonal. If called on empty outline, 0. is returned
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Intersects
 Determine if this Outline intersects the input Outline to within a specified tolerance.
IsScaleValid
 Checks if given scale is valid. Should be greater than zero.
Scale
 Scales the bounding box by given scale.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Outline Class
Autodesk.Revit.DB Namespace